---
kind: method
id: M:Autodesk.Revit.DB.ExportLayerTableIterator.IsDone
source: html/76ac3b0e-6d59-5e49-c53b-53be65b11cea.htm
---
# Autodesk.Revit.DB.ExportLayerTableIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.